OpenFOAM/elliot-7/damBreak11/damBreak11/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       44944;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       45144;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          248;
        startFace       45344;
    }
    atmosphere
    {
        type            patch;
        nFaces          184;
        startFace       45592;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          18144;
        startFace       45776;
    }
)

// ************************************************************************* //
